{
  "title": "RISE-BKAI Lab",
  "siteUrl": "https://riselab.github.io/",
  "description": "Lab website for RISE-BKAI Lab at Hanoi University of Science and Technology, Vietnam",
  "ogImage": "/assets/logos/og-image.jpeg",
  "home": {
    "title": "RISE-BKAI Lab @ Hanoi University of Science and Technology",
    "description": "Our research group is headed by Prof. Huynh Quyet Thang. Our members include faculty members, graduate students, and undergraduate students from Hanoi University of Science and Technology. Besides, we have collaborated with prestigious professors and researchers at world-class universities such as The University of Melbourne and Singapore Management University. Our team primarily works at the intersection of software engineering and artificial intelligence. We are mainly focusing on automated tools that can improve the reliability, transparency, and performance of Software and AI systems and increase developer productivity. Our works have been published in major and premier conferences and journals in software engineering and related fields such as IEEE TSE, ICSE, ESEC/FSE, and ICSME.",
    "interests": "Software Engineering | Artificial Intelligence | Automated Tools | Developer Productivity",
    "news": [
      {
        "date": "May 2024",
        "content": "We are recruiting new members",
        "link": "https://rise-bkai.github.io/contact"
      },
      {
        "date": "April 2024",
        "content": "One of our member, Nguyen Phuc Thanh, got accepted into Singapore Management University as Research Engineer",
        "link": "https://rise-bkai.github.io/people/phucthanhnguyen"
      },
      {
        "date": "March 2024",
        "content": "Our paper entitled LEGION: Harnessing Pre-trained Language Models for GitHub Topic Recommendations with Distribution-Balance Loss is accepted by International Conference on Evaluation and Assessment in Software Engineering (EASE).",
        "link": "https://thanhlecongg.github.io/pdf/EASE_LEGION.pdf"
      },
      {
        "date": "February 2024",
        "content": "One of our member, Le Quoc Hung, got accepted into North Carolina State University as PhD. Student",
        "link": "https://rise-bkai.github.io/people/quochungle"
      }
    ],
    "collaborators": {
      "light": [
        "/assets/logos/unimelb.png",
        "/assets/logos/ncuni.png",
        "/assets/logos/smu.png"
      ],
      "dark": [
        "/assets/logos/unimelb.png",
        "/assets/logos/ncuni.png",
        "/assets/logos/smu.png"
      ]
    },
    "labImage": {
      "light": [
        "/assets/logos/1.jpg",
        "/assets/logos/2.jpg",
        "/assets/logos/3.jpg",
        "/assets/logos/4.jpg",
        "/assets/logos/5.jpg"
      ],
      "dark": [
        "/assets/logos/1.jpg",
        "/assets/logos/2.jpg",
        "/assets/logos/3.jpg",
        "/assets/logos/4.jpg",
        "/assets/logos/5.jpg"
      ]
    }
  }
}
